zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pic32ck1012sg00048.h
/* CMSIS includes */
#include "core_cm33.h"
#if defined USE_CMSIS_INIT
#include "system_pic32ck1012sg00048.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*         SOFTWARE PERIPHERAL API DEFINITIONS FOR PIC32CK1012SG00048         */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/ccl.h"
#include "component/cmcc.h"
#include "component/dma.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/fcr.h"
#include "component/fcw.h"
#include "component/freqm.h"
#include "component/fuses.h"
#include "component/gclk.h"
#include "component/hmatrix2.h"
#include "component/hsm.h"
#include "component/idau.h"
#include "component/mclk.h"
#include "component/mcramc.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pcc.h"
#include "component/pdec.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/prm.h"
#include "component/ptc.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sdmmc.h"
#include "component/sercom.h"
#include "component/spi_ixs.h"
#include "component/sqi.h"
#include "component/supc.h"
#include "component/tcc.h"
#include "component/tram.h"
#include "component/trng.h"
#include "component/usb.h"
#include "component/wdt.h"

/* ************************************************************************** */
/*                INSTANCE DEFINITIONS FOR PIC32CK1012SG00048                 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc.h"
#include "instance/bsdap.h"
#include "instance/ccl.h"
#include "instance/cmcc.h"
#include "instance/dma0.h"
#include "instance/dma1.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/fcr.h"
#include "instance/fcw.h"
#include "instance/flexram.h"
#include "instance/fpu_ns.h"
#include "instance/freqm.h"
#include "instance/fuses.h"
#include "instance/gclk.h"
#include "instance/hmatrix.h"
#include "instance/hsm.h"
#include "instance/idau.h"
#include "instance/mclk.h"
#include "instance/osc32kctrl.h"
#include "instance/oscctrl.h"
#include "instance/pac.h"
#include "instance/pcc.h"
#include "instance/pdec.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/prm.h"
#include "instance/ptc.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/sdmmc0.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/sercom4.h"
#include "instance/sercom5.h"
#include "instance/spi_ixs.h"
#include "instance/sqi.h"
#include "instance/supc.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/tcc3.h"
#include "instance/tcc4.h"
#include "instance/tcc5.h"
#include "instance/tram.h"
#include "instance/trng.h"
#include "instance/usb.h"
#include "instance/wdt.h"

/* ************************************************************************** */
/*              PERIPHERAL ID DEFINITIONS FOR PIC32CK1012SG00048              */
/* ************************************************************************** */
#define ID_DSU           (  0) /* Instance index for DSU (DSU) */
#define ID_FCR           (  1) /* Instance index for FCR (FCR) */
#define ID_FCW           (  2) /* Instance index for FCW (FCW) */
#define ID_PM            (  3) /* Instance index for PM (PM) */
#define ID_SUPC          (  4) /* Instance index for SUPC (SUPC) */
#define ID_RSTC          (  5) /* Instance index for RSTC (RSTC) */
#define ID_OSCCTRL       (  6) /* Instance index for OSCCTRL (OSCCTRL) */
#define ID_OSC32KCTRL    (  7) /* Instance index for OSC32KCTRL (OSC32KCTRL) */
#define ID_GCLK          (  8) /* Instance index for GCLK (GCLK) */
#define ID_MCLK          (  9) /* Instance index for MCLK (MCLK) */
#define ID_FREQM         ( 10) /* Instance index for FREQM (FREQM) */
#define ID_WDT           ( 11) /* Instance index for WDT (WDT) */
#define ID_RTC           ( 12) /* Instance index for RTC (RTC) */
#define ID_EIC           ( 13) /* Instance index for EIC (EIC) */
#define ID_PAC           ( 14) /* Instance index for PAC (PAC) */
#define ID_TRAM          ( 15) /* Instance index for TRAM (TRAM) */
#define ID_FLEXRAM       ( 20) /* Instance index for FLEXRAM (FLEXRAM) */
#define ID_PORT          ( 32) /* Instance index for PORT (PORT) */
#define ID_DMA0          ( 33) /* Instance index for DMA0 (DMA0) */
#define ID_DMA1          ( 34) /* Instance index for DMA1 (DMA1) */
#define ID_HMATRIX       ( 35) /* Instance index for HMATRIX (HMATRIX) */
#define ID_CMCC          ( 36) /* Instance index for CMCC (CMCC) */
#define ID_PRM           ( 37) /* Instance index for PRM (PRM) */
#define ID_IDAU          ( 38) /* Instance index for IDAU (IDAU) */
#define ID_EVSYS         ( 39) /* Instance index for EVSYS (EVSYS) */
#define ID_SERCOM0       ( 40) /* Instance index for SERCOM0 (SERCOM0) */
#define ID_SERCOM1       ( 41) /* Instance index for SERCOM1 (SERCOM1) */
#define ID_SERCOM2       ( 42) /* Instance index for SERCOM2 (SERCOM2) */
#define ID_SERCOM3       ( 43) /* Instance index for SERCOM3 (SERCOM3) */
#define ID_TCC0          ( 44) /* Instance index for TCC0 (TCC0) */
#define ID_TCC1          ( 45) /* Instance index for TCC1 (TCC1) */
#define ID_TCC2          ( 46) /* Instance index for TCC2 (TCC2) */
#define ID_TCC3          ( 47) /* Instance index for TCC3 (TCC3) */
#define ID_SERCOM4       ( 64) /* Instance index for SERCOM4 (SERCOM4) */
#define ID_SERCOM5       ( 65) /* Instance index for SERCOM5 (SERCOM5) */
#define ID_TCC4          ( 68) /* Instance index for TCC4 (TCC4) */
#define ID_TCC5          ( 69) /* Instance index for TCC5 (TCC5) */
#define ID_ADC           ( 72) /* Instance index for ADC (ADC) */
#define ID_AC            ( 73) /* Instance index for AC (AC) */
#define ID_PTC           ( 74) /* Instance index for PTC (PTC) */
#define ID_SPI_IXS       ( 75) /* Instance index for SPI_IXS (SPI_IXS) */
#define ID_PCC           ( 76) /* Instance index for PCC (PCC) */
#define ID_CCL           ( 77) /* Instance index for CCL (CCL) */
#define ID_PDEC          ( 78) /* Instance index for PDEC (PDEC) */
#define ID_TRNG          ( 82) /* Instance index for TRNG (TRNG) */
#define ID_SDMMC0        ( 83) /* Instance index for SDMMC0 (SDMMC0) */
#define ID_USB           ( 85) /* Instance index for USB (USB) */
#define ID_SQI           ( 96) /* Instance index for SQI (SQI) */
#define ID_HSM           ( 98) /* Instance index for HSM (HSM) */

#define ID_PERIPH_MAX    ( 98) /* Number of peripheral IDs */

/* ************************************************************************** */
/*       REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CK1012SG00048        */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x45012000)                 /* AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x45010000)                /* ADC Registers Address        */
#define CCL_REGS                         ((ccl_registers_t*)0x4501a000)                /* CCL Registers Address        */
#define CMCC_REGS                        ((cmcc_registers_t*)0x44808000)               /* CMCC Registers Address       */
#define DMA0_REGS                        ((dma_registers_t*)0x44802000)                /* DMA0 Registers Address       */
#define DMA1_REGS                        ((dma_registers_t*)0x44804000)                /* DMA1 Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x44000000)                /* DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x4401a000)                /* EIC Registers Address        */
#define EIC_SEC_REGS                     ((eic_registers_t*)0x4401b000)                /* EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x4480e000)              /* EVSYS Registers Address      */
#define FCR_REGS                         ((fcr_registers_t*)0x44002000)                /* FCR Registers Address        */
#define FCW_REGS                         ((fcw_registers_t*)0x44004000)                /* FCW Registers Address        */
#define FREQM_REGS                       ((freqm_registers_t*)0x44014000)              /* FREQM Registers Address      */
#define FUSES_BOOTCFG1_REGS              ((fuses_bootcfg1_registers_t*)0x0a002000)     /* FUSES Registers Address      */
#define FUSES_BOOTCFG2_REGS              ((fuses_bootcfg1_registers_t*)0x0a00a000)     /* FUSES Registers Address      */
#define FUSES_DALCFG_REGS                ((fuses_dalcfg_registers_t*)0x0a004000)       /* FUSES Registers Address      */
#define FUSES_USERCFG1_REGS              ((fuses_usercfg1_registers_t*)0x0a000000)     /* FUSES Registers Address      */
#define FUSES_USERCFG2_REGS              ((fuses_usercfg1_registers_t*)0x0a008000)     /* FUSES Registers Address      */
#define FUSES_CALOTP_REGS                ((fuses_calotp_registers_t*)0x0a007000)       /* FUSES Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x44010000)               /* GCLK Registers Address       */
#define HMATRIX_REGS                     ((hmatrix2_registers_t*)0x44806000)           /* HMATRIX Registers Address    */
#define HSM_REGS                         ((hsm_registers_t*)0x48000000)                /* HSM Registers Address        */
#define IDAU_REGS                        ((idau_registers_t*)0x4480c000)               /* IDAU Registers Address       */
#define MCLK_REGS                        ((mclk_registers_t*)0x44012000)               /* MCLK Registers Address       */
#define FLEXRAM_REGS                     ((mcramc_registers_t*)0x44028000)             /* FLEXRAM Registers Address    */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x4400e000)         /* OSC32KCTRL Registers Address */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x4400c000)            /* OSCCTRL Registers Address    */
#define PAC_REGS                         ((pac_registers_t*)0x4401c000)                /* PAC Registers Address        */
#define PCC_REGS                         ((pcc_registers_t*)0x45018000)                /* PCC Registers Address        */
#define PDEC_REGS                        ((pdec_registers_t*)0x4501c000)               /* PDEC Registers Address       */
#define PM_REGS                          ((pm_registers_t*)0x44006000)                 /* PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x44800000)               /* PORT Registers Address       */
#define PORT_SEC_REGS                    ((port_registers_t*)0x44801000)               /* PORT Registers Address       */
#define PRM_REGS                         ((prm_registers_t*)0x4480a000)                /* PRM Registers Address        */
#define PTC_REGS                         ((ptc_registers_t*)0x45014000)                /* PTC Registers Address        */
#define RSTC_REGS                        ((rstc_registers_t*)0x4400a000)               /* RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x44018000)                /* RTC Registers Address        */
#define SDMMC0_REGS                      ((sdmmc_registers_t*)0x45026000)              /* SDMMC0 Registers Address     */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x44810000)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x44812000)             /* SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x44814000)             /* SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x44816000)             /* SERCOM3 Registers Address    */
#define SERCOM4_REGS                     ((sercom_registers_t*)0x45000000)             /* SERCOM4 Registers Address    */
#define SERCOM5_REGS                     ((sercom_registers_t*)0x45002000)             /* SERCOM5 Registers Address    */
#define SPI_IXS_REGS                     ((spi_ixs_registers_t*)0x45016000)            /* SPI_IXS Registers Address    */
#define SQI_REGS                         ((sqi_registers_t*)0x0ffff000)                /* SQI Registers Address        */
#define SUPC_REGS                        ((supc_registers_t*)0x44008000)               /* SUPC Registers Address       */
#define TCC0_REGS                        ((tcc_registers_t*)0x44818000)                /* TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x4481a000)                /* TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x4481c000)                /* TCC2 Registers Address       */
#define TCC3_REGS                        ((tcc_registers_t*)0x4481e000)                /* TCC3 Registers Address       */
#define TCC4_REGS                        ((tcc_registers_t*)0x45008000)                /* TCC4 Registers Address       */
#define TCC5_REGS                        ((tcc_registers_t*)0x4500a000)                /* TCC5 Registers Address       */
#define TRAM_REGS                        ((tram_registers_t*)0x4401e000)               /* TRAM Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0x45024000)               /* TRNG Registers Address       */
#define USB_REGS                         ((usb_registers_t*)0x4502a000)                /* USB Registers Address        */
#define WDT_REGS                         ((wdt_registers_t*)0x44016000)                /* WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ************************************************************************** */
/*              BASE ADDRESS DEFINITIONS FOR PIC32CK1012SG00048               */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UINT32_(0x45012000)                          /* AC Base Address */
#define ADC_BASE_ADDRESS                 _UINT32_(0x45010000)                          /* ADC Base Address */
#define CCL_BASE_ADDRESS                 _UINT32_(0x4501a000)                          /* CCL Base Address */
#define CMCC_BASE_ADDRESS                _UINT32_(0x44808000)                          /* CMCC Base Address */
#define DMA0_BASE_ADDRESS                _UINT32_(0x44802000)                          /* DMA0 Base Address */
#define DMA1_BASE_ADDRESS                _UINT32_(0x44804000)                          /* DMA1 Base Address */
#define DSU_BASE_ADDRESS                 _UINT32_(0x44000000)                          /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UINT32_(0x4401a000)                          /* EIC Base Address */
#define EIC_SEC_BASE_ADDRESS             _UINT32_(0x4401b000)                          /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UINT32_(0x4480e000)                          /* EVSYS Base Address */
#define FCR_BASE_ADDRESS                 _UINT32_(0x44002000)                          /* FCR Base Address */
#define FCW_BASE_ADDRESS                 _UINT32_(0x44004000)                          /* FCW Base Address */
#define FREQM_BASE_ADDRESS               _UINT32_(0x44014000)                          /* FREQM Base Address */
#define FUSES_BOOTCFG1_BASE_ADDRESS      _UINT32_(0x0a002000)                          /* FUSES Base Address */
#define FUSES_BOOTCFG2_BASE_ADDRESS      _UINT32_(0x0a00a000)                          /* FUSES Base Address */
#define FUSES_DALCFG_BASE_ADDRESS        _UINT32_(0x0a004000)                          /* FUSES Base Address */
#define FUSES_USERCFG1_BASE_ADDRESS      _UINT32_(0x0a000000)                          /* FUSES Base Address */
#define FUSES_USERCFG2_BASE_ADDRESS      _UINT32_(0x0a008000)                          /* FUSES Base Address */
#define FUSES_CALOTP_BASE_ADDRESS        _UINT32_(0x0a007000)                          /* FUSES Base Address */
#define GCLK_BASE_ADDRESS                _UINT32_(0x44010000)                          /* GCLK Base Address */
#define HMATRIX_BASE_ADDRESS             _UINT32_(0x44806000)                          /* HMATRIX Base Address */
#define HSM_BASE_ADDRESS                 _UINT32_(0x48000000)                          /* HSM Base Address */
#define IDAU_BASE_ADDRESS                _UINT32_(0x4480c000)                          /* IDAU Base Address */
#define MCLK_BASE_ADDRESS                _UINT32_(0x44012000)                          /* MCLK Base Address */
#define FLEXRAM_BASE_ADDRESS             _UINT32_(0x44028000)                          /* FLEXRAM Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UINT32_(0x4400e000)                          /* OSC32KCTRL Base Address */
#define OSCCTRL_BASE_ADDRESS             _UINT32_(0x4400c000)                          /* OSCCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UINT32_(0x4401c000)                          /* PAC Base Address */
#define PCC_BASE_ADDRESS                 _UINT32_(0x45018000)                          /* PCC Base Address */
#define PDEC_BASE_ADDRESS                _UINT32_(0x4501c000)                          /* PDEC Base Address */
#define PM_BASE_ADDRESS                  _UINT32_(0x44006000)                          /* PM Base Address */
#define PORT_BASE_ADDRESS                _UINT32_(0x44800000)                          /* PORT Base Address */
#define PORT_SEC_BASE_ADDRESS            _UINT32_(0x44801000)                          /* PORT Base Address */
#define PRM_BASE_ADDRESS                 _UINT32_(0x4480a000)                          /* PRM Base Address */
#define PTC_BASE_ADDRESS                 _UINT32_(0x45014000)                          /* PTC Base Address */
#define RSTC_BASE_ADDRESS                _UINT32_(0x4400a000)                          /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x44018000)                          /* RTC Base Address */
#define SDMMC0_BASE_ADDRESS              _UINT32_(0x45026000)                          /* SDMMC0 Base Address */
#define SERCOM0_BASE_ADDRESS             _UINT32_(0x44810000)                          /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UINT32_(0x44812000)                          /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UINT32_(0x44814000)                          /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UINT32_(0x44816000)                          /* SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UINT32_(0x45000000)                          /* SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UINT32_(0x45002000)                          /* SERCOM5 Base Address */
#define SPI_IXS_BASE_ADDRESS             _UINT32_(0x45016000)                          /* SPI_IXS Base Address */
#define SQI_BASE_ADDRESS                 _UINT32_(0x0ffff000)                          /* SQI Base Address */
#define SUPC_BASE_ADDRESS                _UINT32_(0x44008000)                          /* SUPC Base Address */
#define TCC0_BASE_ADDRESS                _UINT32_(0x44818000)                          /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UINT32_(0x4481a000)                          /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UINT32_(0x4481c000)                          /* TCC2 Base Address */
#define TCC3_BASE_ADDRESS                _UINT32_(0x4481e000)                          /* TCC3 Base Address */
#define TCC4_BASE_ADDRESS                _UINT32_(0x45008000)                          /* TCC4 Base Address */
#define TCC5_BASE_ADDRESS                _UINT32_(0x4500a000)                          /* TCC5 Base Address */
#define TRAM_BASE_ADDRESS                _UINT32_(0x4401e000)                          /* TRAM Base Address */
#define TRNG_BASE_ADDRESS                _UINT32_(0x45024000)                          /* TRNG Base Address */
#define USB_BASE_ADDRESS                 _UINT32_(0x4502a000)                          /* USB Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x44016000)                          /* WDT Base Address */

/* ************************************************************************** */
/*                   PIO DEFINITIONS FOR PIC32CK1012SG00048                   */
/* ************************************************************************** */
#include "pio/pic32ck1012sg00048.h"

/* ************************************************************************** */
/*             MEMORY MAPPING DEFINITIONS FOR PIC32CK1012SG00048              */
/* ************************************************************************** */
#define CMCC_DATARAM_SIZE              _UINT32_(0x00001000)    /*    4kB Memory segment type: ram */
#define CMCC_TAGRAM_SIZE               _UINT32_(0x00000400)    /*    1kB Memory segment type: ram */
#define CMCC_VALIDRAM_SIZE             _UINT32_(0x00000040)    /*    0kB Memory segment type: ram */
#define PRM_ROM_SIZE                   _UINT32_(0x00008000)    /*   32kB Memory segment type: rom */
#define FLASH_BFM_SIZE                 _UINT32_(0x00020000)    /*  128kB Memory segment type: flash */
#define FLASH_BFM_PAGE_SIZE            _UINT32_(      4096)
#define FLASH_BFM_NB_OF_PAGES          _UINT32_(        32)

